---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.InvalidObjectException
source: html/a6ed664d-ce61-6bcd-1ff1-7d2386e6b7fc.htm
---
# InvalidObjectException Members

Retrieves data needed to serialize the target object.